{
    "blogs" : [
        {
            "id": 1,
            "topic": "My summer experience", 
            "body": "Holidays are an incredible time for us to visit hilly destinations with the family. The summer season is an excellent time for us to take stress-free excursions and get close to nature, which we are unable to do in our busy schedules for the entire year. Last year I visited my grandparents and stayed there for 15 days. The cool thing about the summer holidays is discovering and creating new things in the village. While enjoying my stay, I also learned some new things that expanded my knowledge. I spent the rest of the holidays playing games and cooking under my mother’s supervision.            Liked the above How I spent my summer vacation paragraph? Children can also attempt to write a few lines or a paragraph on how I spent my summer vacation and mention what they loved about their vacation. Want to explore more such mind-boggling stuff? Are you wondering where you can find more such interesting English essay topics for kids? We’ve got you covered! You can visit our Kids Learning section, where you can find a huge array of resources such as worksheets, stories, poems for kids, GK questions, etc. and make your child fall in love with learning.", 
            "author": "sophia"
        },
        {
            "id": 2, 
            "topic": "School days", 
            "body": "School Life is the best time of our life as we make new friends, learn new things and build our career there. School time is the only time which we enjoy most, and when we enter college, we always miss our school life. School life teaches us lots of new things and prepares us to face all the challenges of life. I love my school life and really enjoy it. I have lots of friends, and all my teachers love me. I love my school and enjoy going there every day to meet my friends and learn new things. Everyone keeps on saying that school life is the best time of your life. When listening to these phrases from their elders, the school students think about what is good about this life. All we do in the entire day is to attend the classes and to do the homework. But once school life gets over, the students realise that school life was the best time of their life. Apart from learning great things in school, you make new friends, play different sports and create memories for the rest of your life. The students also learn many life skills like teamwork, good manners, etc., and understand what they want to become in their life.About My School and School Life I study in the reputed private school in my city, and I am glad to be a student of this school. My school is one of the most renowned schools in my town. It is very beautiful and huge. My school has all the facilities for sports, study and other activities. Built-in a three-storey building, it is a Co-Ed and Senior Secondary School having Science, Arts and Commerce stream. The atmosphere at my school is delightful. ", 
            "author": "maria"
        },
        {
            "id": 3, 
            "topic": "Rainy days", 
            "body": "Rainy days are different from any other day. They hold great importance for everyone differently. People have different reasons to wait for the Rainy Season eagerly. After all, it brings a sigh relief for everyone. No matter what the weather may be, a rainy day relaxes and soothes our soul. There is no age limit to enjoy rainy days people of almost every age enjoy it equally. Thus, rainy days are very important for a number of reasons. As stated earlier, rainy days are enjoyed by people of all ages. The kids are probably the most excited lot of all. Rainy days bring pleasant weather and uplift the moods of kids. Moreover, it gives them a chance to step out and play in the rain, jump in the puddles and make paper boats. Similarly, for students, a rainy day means a break from school. It gives them a break from their monotonous routine as the school declares a holiday. The joy of going to school on a rainy day enjoying the weather and then realizing the school is closed is one of a kind experience. The students become relaxed and spend their day doing other activities like going out with friends and more. If we look at rainy days from the perspective of a common man, we see how it brings them relief from the heat. It changes their mood and also their dull routine. In other words, rainy days give them a chance for rejuvenation amidst the stress. Most importantly, we see rainy days are of utmost importance for farmers. It is quite essential for the production of crops. It provides them with adequate water to make their crops flourish which will eventually benefit them.", 
            "author": "sophia"
        }
    ]
}